In [90]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
students = pd.DataFrame({
    'Name': ['Gaurav', 'Deepratan', 'Arshika', 'Manan', 'Aman', 'Ayushi', 'Ujwal', 'Ashish'],
    'Age': np.random.randint(20, 30, 8),
    'Gender': pd.Categorical(['Male', 'Male', 'Female', 'Male', 'Male', 'Female', 'Male', 'Male']),
    'Course': np.random.choice(['Python', 'DS', 'AWS'], 8)
})

In [3]:
students

        Name  Age  Gender  Course
0     Gaurav   24    Male     AWS
1  Deepratan   27    Male      DS
2    Arshika   26  Female  Python
3      Manan   23    Male     AWS
4       Aman   23    Male      DS
5     Ayushi   20  Female  Python
6      Ujwal   22    Male      DS
7     Ashish   26    Male      DS

In [5]:
students.head(2)

        Name  Age Gender Course
0     Gaurav   24   Male    AWS
1  Deepratan   27   Male     DS

In [6]:
students.head(3)

        Name  Age  Gender  Course
0     Gaurav   24    Male     AWS
1  Deepratan   27    Male      DS
2    Arshika   26  Female  Python

In [7]:
students.head()

        Name  Age  Gender  Course
0     Gaurav   24    Male     AWS
1  Deepratan   27    Male      DS
2    Arshika   26  Female  Python
3      Manan   23    Male     AWS
4       Aman   23    Male      DS

In [8]:
students.tail()

     Name  Age  Gender  Course
3   Manan   23    Male     AWS
4    Aman   23    Male      DS
5  Ayushi   20  Female  Python
6   Ujwal   22    Male      DS
7  Ashish   26    Male      DS

In [9]:
students.tail(2)

     Name  Age Gender Course
6   Ujwal   22   Male     DS
7  Ashish   26   Male     DS

In [10]:
students.tail(3)

     Name  Age  Gender  Course
5  Ayushi   20  Female  Python
6   Ujwal   22    Male      DS
7  Ashish   26    Male      DS

In [12]:
students.shape

(8, 4)

In [11]:
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int32
 2   Gender  8 non-null      category
 3   Course  8 non-null      object
dtypes: category(1), int32(1), object(2)
memory usage: 420.0+ bytes

In [13]:
students.describe()

             Age
count   8.000000
mean   23.875000
std     2.356602
min    20.000000
25%    22.750000
50%    23.500000
75%    26.000000
max    27.000000

In [14]:
students.describe(include='all')

             Name        Age Gender Course
count           8   8.000000      8      8
unique          8        NaN      2      3
top     Deepratan        NaN   Male     DS
freq            1        NaN      6      4
mean          NaN  23.875000    NaN    NaN
std           NaN   2.356602    NaN    NaN
min           NaN  20.000000    NaN    NaN
25%           NaN  22.750000    NaN    NaN
50%           NaN  23.500000    NaN    NaN
75%           NaN  26.000000    NaN    NaN
max           NaN  27.000000    NaN    NaN

In [15]:
d = students.describe()

In [16]:
type(d)

pandas.core.frame.DataFrame

In [17]:
type(students)

pandas.core.frame.DataFrame

In [19]:
students['Gender']

0      Male
1      Male
2    Female
3      Male
4      Male
5    Female
6      Male
7      Male
Name: Gender, dtype: category
Categories (2, object): ['Female', 'Male']

In [20]:
type(students['Gender'])

pandas.core.series.Series

In [23]:
students['Gender'][2] = "F"

ValueError: Cannot setitem on a Categorical with a new category, set the categories first

In [25]:
type(students['Name'])

pandas.core.series.Series

In [26]:
students[['Name']]

        Name
0     Gaurav
1  Deepratan
2    Arshika
3      Manan
4       Aman
5     Ayushi
6      Ujwal
7     Ashish

In [27]:
type(students[['Name']])

pandas.core.frame.DataFrame

In [29]:
students[['Name', 'Course', 'Age']]

        Name  Course  Age
0     Gaurav     AWS   24
1  Deepratan      DS   27
2    Arshika  Python   26
3      Manan     AWS   23
4       Aman      DS   23
5     Ayushi  Python   20
6      Ujwal      DS   22
7     Ashish      DS   26

In [30]:
students

        Name  Age  Gender  Course
0     Gaurav   24    Male     AWS
1  Deepratan   27    Male      DS
2    Arshika   26  Female  Python
3      Manan   23    Male     AWS
4       Aman   23    Male      DS
5     Ayushi   20  Female  Python
6      Ujwal   22    Male      DS
7     Ashish   26    Male      DS

In [31]:
#### Name of students having course Python with age > 25

In [34]:
students[(students['Course'] == "Python") & (students['Age']>25)]

      Name  Age  Gender  Course
2  Arshika   26  Female  Python

In [35]:
students[(students['Course'] == "Python") & (students['Age']>25)]['Name']

2    Arshika
Name: Name, dtype: object

In [36]:
students

        Name  Age  Gender  Course
0     Gaurav   24    Male     AWS
1  Deepratan   27    Male      DS
2    Arshika   26  Female  Python
3      Manan   23    Male     AWS
4       Aman   23    Male      DS
5     Ayushi   20  Female  Python
6      Ujwal   22    Male      DS
7     Ashish   26    Male      DS

#### Name of students starting with A alphabet 
#### Count of different courses
#### How many students are female

In [37]:
students = pd.DataFrame({
    'Name': ['Gaurav', 'Deepratan', 'Arshika', 'Manan', 'Aman', 'Ayushi', 'Ujwal', 'Ashish'],
    'Age': np.random.randint(20, 30, 8),
    'Gender': pd.Categorical(['Male', 'Male', 'Female', 'Male', 'Male', 'Female', 'Male', 'Male']),
    'Course': np.random.choice(['Python', 'DS', 'AWS'], 8)      
})

In [38]:
students

        Name  Age  Gender  Course
0     Gaurav   27    Male  Python
1  Deepratan   26    Male     AWS
2    Arshika   25  Female      DS
3      Manan   26    Male     AWS
4       Aman   25    Male     AWS
5     Ayushi   26  Female      DS
6      Ujwal   28    Male     AWS
7     Ashish   22    Male     AWS

### Indexing 
    
        loc
            labels
        iloc
            index

In [40]:
students.index = pd.date_range('20210116', periods=8)

In [41]:
students

                 Name  Age  Gender  Course
2021-01-16     Gaurav   27    Male  Python
2021-01-17  Deepratan   26    Male     AWS
2021-01-18    Arshika   25  Female      DS
2021-01-19      Manan   26    Male     AWS
2021-01-20       Aman   25    Male     AWS
2021-01-21     Ayushi   26  Female      DS
2021-01-22      Ujwal   28    Male     AWS
2021-01-23     Ashish   22    Male     AWS

In [42]:
students[3]

KeyError: 3

In [43]:
students.iloc[3]

Name      Manan
Age          26
Gender     Male
Course      AWS
Name: 2021-01-19 00:00:00, dtype: object

In [44]:
type(students.iloc[3])

pandas.core.series.Series

In [45]:
students.iloc[3]

Name      Manan
Age          26
Gender     Male
Course      AWS
Name: 2021-01-19 00:00:00, dtype: object

In [46]:
students.iloc[3, 2]

'Male'

In [47]:
students.iloc[::-1]

                 Name  Age  Gender  Course
2021-01-23     Ashish   22    Male     AWS
2021-01-22      Ujwal   28    Male     AWS
2021-01-21     Ayushi   26  Female      DS
2021-01-20       Aman   25    Male     AWS
2021-01-19      Manan   26    Male     AWS
2021-01-18    Arshika   25  Female      DS
2021-01-17  Deepratan   26    Male     AWS
2021-01-16     Gaurav   27    Male  Python

In [48]:
students.iloc[::-1, ::-1]

            Course  Gender  Age       Name
2021-01-23     AWS    Male   22     Ashish
2021-01-22     AWS    Male   28      Ujwal
2021-01-21      DS  Female   26     Ayushi
2021-01-20     AWS    Male   25       Aman
2021-01-19     AWS    Male   26      Manan
2021-01-18      DS  Female   25    Arshika
2021-01-17     AWS    Male   26  Deepratan
2021-01-16  Python    Male   27     Gaurav

In [50]:
students.iloc[,1]

SyntaxError: invalid syntax (<ipython-input-50-9232641db624>, line 1)

In [51]:
students.iloc[:,1]

2021-01-16    27
2021-01-17    26
2021-01-18    25
2021-01-19    26
2021-01-20    25
2021-01-21    26
2021-01-22    28
2021-01-23    22
Freq: D, Name: Age, dtype: int32

In [53]:
students.iloc[::2,::2]

               Name  Gender
2021-01-16   Gaurav    Male
2021-01-18  Arshika  Female
2021-01-20     Aman    Male
2021-01-22    Ujwal    Male

In [55]:
students.iloc[[2, 3, 4, 6]]

               Name  Age  Gender Course
2021-01-18  Arshika   25  Female     DS
2021-01-19    Manan   26    Male    AWS
2021-01-20     Aman   25    Male    AWS
2021-01-22    Ujwal   28    Male    AWS

In [57]:
students.iloc[[2, 3, 4, 6], [0, 2, 3]]

               Name  Gender Course
2021-01-18  Arshika  Female     DS
2021-01-19    Manan    Male    AWS
2021-01-20     Aman    Male    AWS
2021-01-22    Ujwal    Male    AWS

In [58]:
students.loc[2]

KeyError: 2

In [59]:
students.loc['2021-01-17']

Name      Deepratan
Age              26
Gender         Male
Course          AWS
Name: 2021-01-17 00:00:00, dtype: object

In [60]:
students.loc['2021-01-17', 'Age']

26

In [61]:
students.loc['2021-01-17', ['Age', 'Gender']]

Age         26
Gender    Male
Name: 2021-01-17 00:00:00, dtype: object

In [62]:
students.loc['2021-01-17'::2, ['Age', 'Gender']]

            Age  Gender
2021-01-17   26    Male
2021-01-19   26    Male
2021-01-21   26  Female
2021-01-23   22    Male

In [63]:
students.loc['2021-01-17':'2021-01-21', ['Age', 'Gender']]

            Age  Gender
2021-01-17   26    Male
2021-01-18   25  Female
2021-01-19   26    Male
2021-01-20   25    Male
2021-01-21   26  Female

In [64]:
students.loc['2021-01-17':'2021-01-21':2, 'Name':'Gender']

                 Name  Age  Gender
2021-01-17  Deepratan   26    Male
2021-01-19      Manan   26    Male
2021-01-21     Ayushi   26  Female

In [68]:
df = pd.DataFrame(np.random.randn(5, 5), columns=list('ABCDE'))

In [70]:
df.loc[0]

A    0.621506
B    1.243144
C   -0.153271
D    0.947655
E    0.523651
Name: 0, dtype: float64

In [71]:
df.loc[1:4]

          A         B         C         D         E
1  0.167541 -0.336118 -2.087910  0.492826 -0.833919
2  1.087953 -0.056295  0.039450  0.170725 -1.252364
3 -0.928794 -0.577614 -0.208083 -0.039414  1.564195
4  1.257974 -0.245971 -0.803595 -0.524638 -0.260345

In [72]:
df.loc[1:4, 'B']

1   -0.336118
2   -0.056295
3   -0.577614
4   -0.245971
Name: B, dtype: float64

    at 
        [row_label, col_label]
        no slicing
    iat
        [row_index, col_index]
        no slicing

In [74]:
df.at[0, 'A']

0.6215056946504028

In [75]:
students.at['2021-01-16':'2021-01-20', 'Age']

TypeError: 'slice('2021-01-16', '2021-01-20', None)' is an invalid key

In [76]:
students.at['2021-01-20', 'Age']

25

In [77]:
students.iat[0, 0]

'Gaurav'

In [78]:
students.at[::-1]

TypeError: _get_value() missing 1 required positional argument: 'col'

In [79]:
%%timeit

students.loc['2021-01-20', 'Age']

1.25 ms ± 68.2 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [80]:
%%timeit

students.at['2021-01-20', 'Age']

407 µs ± 32.1 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [81]:
%%timeit

students.iat[0, 0]

59.7 µs ± 4.77 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [82]:
%%timeit

students.iloc[0, 0]

66.6 µs ± 6.43 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [83]:
df

          A         B         C         D         E
0  0.621506  1.243144 -0.153271  0.947655  0.523651
1  0.167541 -0.336118 -2.087910  0.492826 -0.833919
2  1.087953 -0.056295  0.039450  0.170725 -1.252364
3 -0.928794 -0.577614 -0.208083 -0.039414  1.564195
4  1.257974 -0.245971 -0.803595 -0.524638 -0.260345

In [85]:
df.at[0, 'A']

0.6215056946504028

In [89]:
students[students['Name'].str.startswith("A")]['Name']

2021-01-18    Arshika
2021-01-20       Aman
2021-01-21     Ayushi
2021-01-23     Ashish
Name: Name, dtype: object

In [91]:
tip = sns.load_dataset("tips")

In [92]:
tip.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [93]:
#### create 5 questions each

In [94]:
tip.shape

(244, 7)